/**
 * Vue课程安排:
 * 1.Vue基础内容---6天
 * 2.Vue的项目(硅谷外卖)---7天(1天stylus的布局,6天是项目(5天纯项目,1天是Vue的知识点))
 * 3.微信的小程序及项目(3天安排)
 * 4.实战(8天左右)
 * 课程介绍:
 * 1.Vue的核心内容:基础相关的知识点
 * 2.todolist案例:组件之间的通信
 * 3.异步的相关的操作
 * 4.Vuex的操作
 * 5.源码的分析
 * 
 * 
 * 总结:
 * Vue是一个渐进式的JS框架
 * 渐进式:本身实现的功能有限,只要引入相关的包或者是插件,就可以实现更多的功能
 * Vue借鉴了React和angular
 * Vue 不支持 IE8 及以下版本，因为 Vue 使用了 IE8 无法模拟的 ECMAScript 5 特性。但它支持所有兼容 ECMAScript 5 的浏览器。
 * 
 * 
 * MVVM
 * M:model----数据模型
 * V:-----视图
 * VM:----Vue的实例对象
 * 数据发生改变,视图会发生相应的变化,中间是通过Vue的实例来完成的
 * 
 * Vue开发(编写代码)
 * 步骤(流程):
 * 1.安装Vue相关的包(相关的文件)
 * 2.安装三种方式:
 *  1) 直接通过BootCDN引入
 *  在线方式
 * <script src="https://cdn.bootcss.com/vue/2.6.10/vue.js"></script>
 *  2) 直接下载Vue的相关文件,引入vue.js文件
 *  在www.github.com中搜索Vue,然后找到对应的相关的文件,找master分支,直接下载压缩包
 *  在该压缩包中找dist目录,里面找vue.js文件,直接在自己的开发的html文件中引入即可
 *  3)
 *  下载脚手架的方式,直接可以在内部进行Vue的相关的开发(2的版本和3的版本)
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 */
